//http არის Hyper text transfer protocol

//get- მოაქვს ინფორმაცია
//post- აგზავნის ინფორმაციას
//delete- შლის ინფორმაციას
//put - ცვლის ინფორმაციას

//200- ყველაფერი კარგია
//404- ვერ ვიპოვე
//500- შეცდომა სერვერზე

//async- კოდის ნაწილი რომელიც კეთდება პარალელურად ანუ არ ელოდება სხვას

//HTTP და HTTPS არის წესები (პროტოკოლები), რომლითაც შენი ბრაუზერი და ვებ-საიტი ერთმანეთს ელაპარაკებიან, HTTP = ღია წერილი (ყველას შეუძლია წაკითხვა)

//HTTPS = დახურული კონვერტი (მხოლოდ მიმღებს შეუძლია გახსნა)

//Encryption არის პროცესი, როცა ინფორმაცია “იკეტება” სპეციალური კოდით, რომ სხვამ ვერ წაიკითხოს
//ინფორმაციის დამალვა ისე, რომ მხოლოდ სწორ ადამიანს შეეძლოს წაკითხვა