// 1)შექმენით ერთი სეტი სადაც მოათავსებთ რამდენიმე ელემენტს(ერთნაირი ელემენტები მეორდებოდეს რამდენჯერმე)

// შენი დავალებაა რომ სეტში დაამატო რამდენიმე განსხვავებული ელემენტი(გამოიყენე CHAIN + მეთოდი)

// შემდეგ ამოშალე ის ელემენტი სეტიდან რომელიც პირველია სეტში

// შემდეგ შეამოწმე არის თუ არა თქვენთვის სასურველი ელემენტი სეტში

// შემდეგ კონსოლში გამოიტანე სეტის სიგრძე

// შემდეგ შექმენი ცვლადი და გამოიყენე ENTRIES მეთოდი სეტზე,ამის შემდეგ გადაუარე FOREACH ით და გამოიტანე წყვილად(სიებად)

// ამის შემდეგ გაასუფთავეთ მთლიანი სეტი

let set = new Set([1,2,3,4,5,6,7,8,8,8,9,9,10])

set.add(20).add("luka")

set.delete(1)

console.log(set)

console.log(seti.has(2))

console.log(set.size)

let ent = set.entries()

ent.forEach(element => {
    console.log(element)
})

set.clear()