//1)კომენტარის სახით ახსენით თუ რა არის truthy და falsy მნშიშვნელობები

//JavaScript-ში, როცა ვიყენებთ პირობას (if, while, ternary operator და ა.შ.), მნიშვნელობა ავტომატურად გარდაიქმნება Boolean ტიპად (true ან false).

//Truthy - ეს არის ნებისმიერი მნიშვნელობა რომელიც არ არის falsy, ანუ რომელიც არ არის 0, "", null, undefined, NaN და false. მაგალითად: "Hello", 1, [], {} და ა.შ.
//Falsy - ეს არის ისეთი მნიშვნელობები რომლებიც ითვლება ცრუ (false) მნიშვნელობებად. მაგალითად: 0, "", null, undefined, NaN და false.

//Falsy → პროგრამა აღიქვამს როგორც false
//Truthy → პროგრამა აღიქვამს როგორც true