# 1)შექმენით ორი განსხვავებული ცვლადი ერთში შეიყვანთ თქვენს სახლეს ხოლო მეორეში თქვენს გვარს შემდენგ კი თითოეული მათგანი დაპრინტეთ შემდეგ კი კომენტარების დახმარებით (#) ახსენით თქვენი დაწერილი კოდი.

# ცვლადის შექმნა სახელისთვის
first_name = "luka"  # აქ "first_name" არის ცვლადი, სადაც ინახება ჩემი სახელი როგორც სტრინგი (ტექსტი).

# ცვლადის შექმნა გვარისთვის
last_name = "keleptrishvili"  # აქ "last_name" არის ცვლადი, სადაც ინახება ჩემი გვარი.

# თითოეული ცვლადის დაბეჭდვა
print(first_name)  # ეს კოდი ბეჭდავს ცვლადის first_name მნიშვნელობას (ესეიგი სახელს).
print(last_name)   # ეს კოდი ბეჭდავს ცვლადის last_name მნიშვნელობას (ესეიგი გვარს).