# ცვლადის დანიშნულება:
# ცვლადი ინახავს მონაცემებს, რომლებსაც მოგვიანებით შეგვიძლია მივაწვდინოთ ან ვამუშავოთ.
# ცვლადები ქმნიან დროულად შეცვლადი სივრცეს, სადაც ვინახავთ მონაცემებს და ეს მონაცემები შეგვიძლია ვიყენოთ პროგრამის სხვადასხვა ადგილებში.

# ცვლადის შექმნა
name = "luka"  # ცვლადი 'name' ინახავს ტექსტურ მონაცემს, რომელიც არის ჩემი სახელი.

age = 15  # ცვლადი 'age' ინახავს რიცხვითი მონაცემს, რომელიც არის ჩემი ასაკი.

grade = 10  # ცვლადი 'grade' ინახავს რიცხვითი მონაცემს, რომელიც არის ჩემი კლასი (მე-10 კლასელი).

school = "Orthodox secondary school named after the Holy Twelve Apostles of Mtskheta"  # ცვლადი 'school' ინახავს ტექსტურ მონაცემს, რომელიც არის ჩემი სკოლა.

hobby = "Computer programming; free time coding"  # ცვლადი 'hobby' ინახავს ტექსტურ მონაცემს, რომელიც არის ჩემი ჰობი.

# ცვლადი ანუ (variable) არის სახელით მოხსენიებული კონტეინერი, რომელიც ინახავს მონაცემებს (ტექსტი, რიცხვი, და სხვა).
# ცვლადს შეიძლება მივცეთ ნებისმიერი სახელი, თუმცა უნდა დავიცვათ გარკვეული წესები.
# ცვლადი საშუალებას გვაძლევს დავაზოგოთ და გამოვიყენოთ მონაცემები, რომლებიც შეიძლება შეიცვალოს პროგრამის შესრულების განმავლობაში.

# ცვლადი ქმნის მონაცემის "მონაცემთა კაფსულას", რომელსაც შეგვიძლია მოგვიანებით მივაწვდენდეთ ან შეცვალოთ.

# დასკვნა:
# ცვლადი Python-ში არის ერთ-ერთი უმნიშვნელოვანესი და გამოყენებადი კონცეფცია. ის მუშაობს როგორც დროულად შეცვლადი კონტეინერი, რომელიც ინახავს მონაცემებს (ტექსტი, რიცხვები, ლოგიკა) და ამ მონაცემებზე განხორციელდება ოპერაციები, რასაც Python უზრუნველყოფს. ცვლადების გამოყენება ხელს უწყობს პროგრამის ორგანიზაციას, გასაგებადობას და მაღალი დონის ფუნქციონალობის შექმნას.

# დანიშნულება: ცვლადის ძირითადი დანიშნულება კი ისაა, რომ შეინახოს და გამოიყენოს მონაცემები პროგრამაში, რითაც ვიზუალიზდება კონკრეტული ოპერაციები, როგორიცაა გაცემული შედეგი, სტატისტიკა ან სხვა ტიპის გაანგარიშებები.