// 10)let z = 1;

// function test() {
//   let z = 2;
//   console.log(z);
// }

// test();
// console.log(z);

// რატომ განსხვავდება შედეგი?

let z = 1;

function test() {
    let z = 2;
    console.log(z); // დაიბეჭდება 2, რადგან ეს z არის ფუნქციის შიგნით შექმნილი ცვლადი და ის ამ ფუნქციაშია ხელმისაწვდომი
}
test();
console.log(z); // დაიბეჭდება 1, რადგან ეს z არის გლობალური ცვლადი და ის ფუნქციის გარეთ არის ხელმისაწვდომი. ფუნქციის შიგნით შექმნილი z არ ახდენს გავლენას გლობალურ z-ზე

//test() ფუნქციის შიგნით არსებული z არის ლოკალური. ის ფარავს გლობალურ z-ს მხოლოდ ფუნქციის შიგნით. ამიტომ ფუნქციაში იბეჭდება 2, გარეთ კი — 1