// 11)დაწერე:

// for (let i = 0; i < 3; i++) {
//   console.log(i);
// }
// console.log(i);

// console.log(i) ციკლიდან გარეთ რა შედეგს იძლევა და რატომ?

for (let i = 0; i < 3; i++) {
    console.log(i); // დაიბეჭდება 0, 1, 2 - რადგან i არის ციკლის შიგნით შექმნილი ცვლადი და ის ამ ციკლშია ხელმისაწვდომი
}
console.log(i);  // Error: i is not defined.
// არ დაიბეჭდება (Error), რადგან i არის let-ით დეკლარირებული ცვლადი და ის მხოლოდ ციკლის ბლოკშია ხელმისაწვდომი. ციკლის გარეთ i არ არსებობს და let-ით გამოცხადებული i მხოლოდ ციკლის ბლოკში არსებობს.