// 12)let name = "Goga";

// function changeName() {
//   name = "Nika";
// }

// changeName();
// console.log(name);

// რა გამოვა და რატომ?

let name = "Goga";

function changeName() {
    name = "Nika"; // ეს ცვლადი არის გლობალური, რადგან ის ფუნქციის გარეთ არის დეკლარირებული. ამიტომ ფუნქციაში name-ს მნიშვნელობა შეიცვლება და ის გახდება "Nika"
}
changeName();
console.log(name); // დაიბეჭდება "Nika", რადგან changeName() ფუნქციამ შეცვალა გლობალური name ცვლადის მნიშვნელობა "Nika"-ზე. ფუნქციის შიგნით name-ს მნიშვნელობა არ არის ლოკალური, ის არის გლობალური და ამიტომ ფუნქციის გარეთაც ჩანს.
//გამოვა "Nika". რადგან ფუნქციის შიგნით ახალი ცვლადი კი არ შევქმენით, არამედ პირდაპირ გლობალურ name-ს შევუცვალეთ მნიშვნელობა.