// 13)დაწერე კოდი, სადაც:

// global ცვლადი x = 10

// for ციკლში შექმენი let x = 0 და დააბეჭდე

// ციკლიდან გარეთ დააბეჭდე global x

let x = 10; // გლობალური ცვლადი

for (let i = 0; i < 1; i++) {
    let x = 0; // ციკლის შიგნით შექმნილი ცვლადი, რომელიც ფარავს გლობალურ x-ს
    console.log(x); // დაიბეჭდება 0, რადგან ეს x არის ციკლის შიგნით შექმნილი და ის ამ ციკლშია ხელმისაწვდომი
}
console.log(x); // დაიბეჭდება 10, რადგან ეს x არის გლობალური ცვლადი და ის ციკლის გარეთ არის ხელმისაწვდომი. ციკლის შიგნით შექმნილი x არ ახდენს გავლენას გლობალურ x-ზე
