// 14)დაწერე კოდი, სადაც:

// შექმენი global ცვლადი name

// if ბლოკში შექმენი ცვლადი name და დააწერე სხვა მნიშვნელობა

// დააბეჭდე name ბლოკის გარეთ

let name = "guga"; // გლობალური ცვლადი
if (true) { 
    let name = "shalva"; // if ბლოკში შექმნილი ცვლადი, რომელიც ფარავს გლობალურ name-ს 
    console.log(name);  // დაიბეჭდება "shalva", რადგან ეს name არის if ბლოკში შექმნილი და ის ამ ბლოკშია ხელმისაწვდომი
}    
console.log(name);  // დაიბეჭდება "guga", რადგან ეს name არის გლობალური ცვლადი და ის if ბლოკის გარეთ არის ხელმისაწვდომი. if ბლოკში შექმნილი name არ ახდენს გავლენას გლობალურ name-ზე. 