# 2) შექმენით ფუნქცია რომელიც მიიღებს 2 პარამეტრს და შემდეგ დაბეჭდავს მათ ჯამს, გამოიძახეთ ფუნქცია 5-ჯერ. კომენტარებით დაწერეთ ყველაფერი რაც იცით ფუნქციების შესახებ: რა არის? რატომ ვიყენებთ? რაში გვეხმარება და სხვა

def sum_number(x,y):
    print(x+y)

sum_number(6,5)
sum_number(43,567)
sum_number(34,456)
sum_number(345,435)
sum_number(435,356)

# def არის პითონის გასაღები სიტყვა (keyword), რომელსაც ვიყენებთ ფუნქციის განსაზღვრისას. როცა ახალ ფუნქციას ვქმნით, პირველად ვწერთ def, შემდეგ ამჯობინებთ ფუნქციის სახელის და არგუმენტების (თუ საჭიროა) მითითებას.

# def თუ როგორ მუშაობს?

# 1. ფუნქცია იწყება def-ით.

# 2. შემდეგ ვწერთ ფუნქციის სახელს.

# 3. შემდეგ მრგვალ ფრჩხილებში ვწერთ არგუმენტებს (თუ გვჭირდება).

# 4. შემდეგ ფუნქციის ბლოკში (შეიძლება იყოს სხვადასხვა მოქმედებები) ვწერთ კოდის პირს.