# 1) შექმენით სია რომელშიც მოათვსებთ 10 განსხვავებულ მანქანის სახელს, შემდეგ დაბეჭდეთ ცალ ცალკე მეორე და მეხუთე ელემენტები, დაბეჭდეთ თავიდან შუამდე ყველა ელემენტი, დაბეჭდეთ შუიდან ბოლომდე ყველა ელემენტი, დაბეჭდეთ მინუს 3 ინდექსზე და -1 ინდექსზე მდგომი ელემენტი, დაბეჭდეთ შუა სამი ელემენტი, დაბეჭდეთ მთლიანი სია.

my_cars = ["Audi", "Mercedes", "BMW", "Mustang", "opel", "porshe", "lamborghini", "Bentley", "Buick", "Alfa Romeo"]

print(my_cars[2], my_cars[5])

print(my_cars[0:5])

print(my_cars[0:])

print(my_cars[-3:-1])

print(my_cars[3:7])