# 2) დაატრიალეთ ციკლი while loop ის გამოყენებით 1 დან 30 მდე
# დაატრიალეთ ციკლი while loop ის გამოყენებით 10 დან 20მდე
# დაატრიალეთ ციკლი while loop ის გამოყენებით 0 დან 30მდე ისე რომ დაბეჭდოთ მხოლო ლუწი რიცხვები if ის გამოყენებით
# დაატრიალეთ ციკლი while loop ის გამოყენებით 5 დან 50მდე ისერომ დაბეჭდოთ მხოლოდ კენტი რიცხვები


# Task 1

i = 1

while i < 30:
    print(i)

    i = i + 1

# Task 2

i = 10

while i < 20:
    print(i)
    
    i = i + 1

# Task 3

i = 0

while i < 30:
    if i % 2 == 0:
        print(i)

    i = i + 1
   
# Task 4

i = 5

while i < 50:
    if i % 2 == 1:
        print(i)
    i = i + 1