# 2) დაატრიალეთ ციკლი while loop ის გამოყენებით 1 დან 30 მდე
# დაატრიალეთ ციკლი while loop ის გამოყენებით 10 დან 20მდე
# დაატრიალეთ ციკლი while loop ის გამოყენებით 0 დან 30მდე ისერომ დაბეჭდოთ მხოლო ლუწი რიცხვები if ის გამოყენებით
# დაატრიალეთ ციკლი while loop ის გამოყენებით 5 დან 50მდე ისერომ დაბეჭდოთ მხოლოდ კენტი რიცხვები

i = 0

while i < 30:
    print(i)
    i += 1

u = 10

while u < 20:
    print(u)
    u += 1 

y = 0

while y < 30:
    if y % 2 == 0:
        print(y)
    y += 1
   
t = 5

while t < 50:
    if t % 2 != 0:
        print(t)
    t += 1 