# 3)  დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 30 დან 70მდე ლუწ რიცხვებს if ის გარეშე
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 0 დან 30მდე კენტ რიცხვებს if ის გარეშე
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 5 დან 50მდე ხუთის ჯერად რიცხვებს if ის გამოყენებით
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 5 დან 50მდე ხუთის ჯერად რიცხვებს if ის გარეშე
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 10 დან 50მდე რიცხვებს და გვერდით მიუწერს ლუწია თუ კენტი

i = 30

while i < 70:   
    print(i)
    i += 2

u = 0

while u < 30:
    print(u)
    u += 3

y = 5

while y < 50:
    if y % 5 == 0:
        print(y)
    y += 1

t = 5

while t < 50:        
   print(t)
   t += 5 

r = 10

while r < 50:
    if r % 2 == 0:
        print(str(r) + "-" + "even")
    else:
        print(str(r) + "-" + "odd")   
    r += 1 