# 3)  დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 30 დან 70მდე ლუწ რიცხვებს if ის გარეშე
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 0 დან 30მდე კენტ რიცხვებს if ის გარეშე
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 5 დან 50მდე ხუთის ჯერად რიცხვებს if ის გამოყენებით
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 5 დან 50მდე ხუთის ჯერად რიცხვებს if ის გარეშე
# დაატრიალეთ ციკლი while loop ის გამოყენებით რომელიც დაგვიბეჭდავს 10 დან 50მდე რიცხვებს და გვერდით მიუწერს ლუწია თუ კენტი


# Task 1

i = 30

while i <= 70:
    print(str(i) + "This is an even number")
    i = i + 2


# Task 2

i = 1

while i < 30:
    print(str(i) + "This is an odd number")
    i = i + 2


# Task 3

i = 5

while i <= 50:
    if i % 5 == 0:
        print(str(i) + "is a multiple of 5")
    i = i + 1


# Task 4

i = 5

while i <= 50:
    print(i)
    i += 5


# Task 5

i = 10

while i <= 50:
    if i % 2 == 0:
        print(str(i) + "-" + "even")
    else:
        print(str(i) + "-" + "odd")
    i += 1