# 1) შეადარეთ ორი რიცხვი ერთმანეთს ყველა შესაძლო შედარების ოპერატორის გამოყენებით, ახსენით კომენტარის სახით თქვენი სიტყვებით რა არის boolean ი და რაში გვჭირდება შედარების ოპერატორები.

print("23424 == 232455 =>" + str(23424 == 232455))
print("23424 == 23424 =>" + str(23424 == 23424))


print(20 == 20)
print(20 < 50)
print(60 > 20)
print(20 <= 20)
print(550 >= 70)

# bool (Boolean) ტიპი პროგრამირებაში არის მონაცემთა ტიპი, რომელიც შეიძლება მიიღოს მხოლოდ ორი მნიშვნელობა: True (სიმართლე) ან False (მცდარი).
# ოპერატორები > და < შედარებითი ოპერატორებია Python-ში და სხვა პროგრამირების ენებში. ისინი გამოიყენება ორი მნიშვნელობის შედარებისთვის და აბრუნებენ True ან False, რაც დამოკიდებულია პირობის შესრულებაზე.