# 3)
# შევნამათ ცვლადი რომელიც დაიანგარიშებს საბოლოო შედეგს result
# 5-ჯერ შევეკითხოთ  for ლუპის გამოყენებით, მომხარებელს სხვადასხვა ციფრებბი
# შევკრიბავთ += გმაოყენებთ და print  -ში 
# გამოვითვლით საშუალო არითმეტიკულს ამ ციფებისას <3 

# შექმენი ცვლადი result რომელიც დაიანგარიშებს საბოლოო შედეგს, მომხმარებელს for loop-ის გამოყენებით 5-ჯერ შემოატანინე რუცხვები და ეს რიცხვები ჩააგდე result-ში += გამოყენებით და გამოითვალე საშვალო არითმეტიკული და დაპრინტე შედეგი(result)

result = 0
for i in range(5):
    number = float(input("enter a number: "))
    result += number

average = result / 5
print(f"Note the arithmetic {5} mean of the number: {average}")