# 4) შექმენით ფუქცნია რომელიც 120 ჯერ გამოიტანს შემდეგი სახის ფუქგურები
# ******
# ******
# ******

#     *
#    ***
#  *******
# ***********
#     *
#     *

# *******
#  *******
#  ********
#    ********

def print_figures():
    
    figure1 = '''******
                ******
                ******'''
    
    
    figure2 = '''     *
    ***
  *******
***********
     *
     *'''
    
 
    figure3 = '''*******
                    ****** 
                    ********
                     ********'''
    

    for i in range(120):
            print(figure1)
            print(figure2)
            print(figure3)


print_figures()