//serverები და clientები
//server არის ესე ვთქვათ რაღაც კომპიუტერი სადაც ინფორმაცია ინახება
//client არის პროგრამა რომელიც ითხოვს ინფორმაციას სერვერისგან

//http მეთოდებში გვაქვს Get, Post, put, delete
//გვაქვს კიდევ response კოდები ეს მოთხოვნას უგზავნის სერვერს და სერვერი მერე პასუხობს კოდის ნომრებით, ესენია 200, 400, 401, 404 და 500. 

//არის ასევე request და responses 
//requestით ვითხოვთ ინფორმაციას სერვერისგან ხოლო response საშუალებით ვიღებ პასუხს

//გვაქვს კიდევ სინქრონული და ასინქრონული. სინქრონულში მუშაობს რიგ-რიგობით ანუ ნაბიჯებად მივყვები და და ვასრულებ ხოლო ასინქრონულში იმუშავებს დალოდების გარეშე რაღაც საქმეს, ანუ ასე ვთქვათ არ ეკიდება იმ პროცესს