# 5)ჩამოწერეთ რომელი data type'ბი იცით და ახსენით რა რას ემსახურება.

# ჯერ ვიცით მხოლოდ და მხოლოდ str, int, float.
# სტრინგი (string) Python-ში არის ტექსტური მონაცემის ტიპი, რომელიც გამოიყენება სიმბოლოების დასამუშავებლად. სტრინგები შეიძლება იყოს ტექსტი, ციფრები ან სპეციალური სიმბოლოები, მაგრამ ისინი ყოველთვის იწერება ბრჭყალებში (ერთეულ '' ან ორმაგ "");
# (integer) არის მონაცემთა ტიპი Python-ში, რომელიც ინახავს მთელ რიცხვებს (დადებითი, უარყოფითი ან ნული). ინტეჯერები არ შეიცავენ ათწილად ნაწილს (დაცული წერტილი);
# (float) არის მონაცემთა ტიპი Python-ში, რომელიც ინახავს ნამდვილი რიცხვების მნიშვნელობებს (ათწილადი ნაწილით). ფლოათები გამოიყენება მაშინ, როცა საჭიროა დაცული წერტილით რიცხვების დამუშავება ან უფრო ზუსტი გამოთვლები.